Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: lispref/numbers.texi:1167 This returns the square root of @var{arg}. If @var{arg} is negative, it signals a @code{domain-error} error.
fr_fr: Ceci renvoie la racine carrée de @var{arg}. Si @var{arg} est négatif, il signale une erreur @code{domain-error}.

source: lispref/numbers.texi:1179 A deterministic computer program cannot generate true random numbers. For most purposes, @dfn{pseudo-random numbers} suffice. A series of pseudo-random numbers is generated in a deterministic fashion. The numbers are not truly random, but they have certain properties that mimic a random series. For example, all possible values occur equally often in a pseudo-random series.
fr_fr: Un programme machine déterministe ne peut pas produire de véritables nombres aléatoires. Dans la plupart des cas, @dfn{pseudo-randam numbers} suffit. Une série de nombres pseudo-aléatoires est produite d'une façon déterminée. Les nombres ne sont pas vraiment aléatoires, mais ils ont certaines propriétés à imiter une série aléatoire. Par exemple, toutes les valeurs possibles se produisent également souvent dans une série pseudo-aléatoire.

source: lispref/numbers.texi:1188 In Emacs, pseudo-random numbers are generated from a ``seed'' number. Starting from any given seed, the @code{random} function always generates the same sequence of numbers. Emacs always starts with the same seed value, so the sequence of values of @code{random} is actually the same in each Emacs run! For example, in one operating system, the first call to @code{(random)} after you start Emacs always returns @minus{}1457731, and the second one always returns @minus{}7692030. This repeatability is helpful for debugging.
fr_fr: Dans Emacs, des nombres pseudo-aléatoires sont produits à partir de ``graine'' de nombre. À partir de n'importe quelle graine donnée, la fonction @code{random} produit toujours le même ordre de nombres. Emacs démarre toujours par la même valeur de graine, ainsi la séquence des valeurs de @code{random} est réellement les mêmes dans chaque passe d'Emacs ! Par exemple, dans un logiciel d'exploitation, le premier appel à @code{(random)}, après que vous démarriez Emacs, retourne toujours @minus{}1457731, et le second renvoie toujours @minus{}7692030. Cette répétition est utile pour la correction.

source: lispref/numbers.texi:1192 If you want random numbers that don't always come out the same, execute @code{(random t)}. This chooses a new seed based on the current time of day and on Emacs's process @acronym{ID} number.
fr_fr: Si vous voulez des nombres aléatoires qui ne sont pas toujours pareils, exécuter @code{(random t)}. Ceci choisit une nouvelle graine basée sur l'heure courante du jour et sur le numéro du processus @acronym{ID} d'Emacs.

source: lispref/numbers.texi:1196 This function returns a pseudo-random integer. Repeated calls return a series of pseudo-random integers.
fr_fr: Cette fonction renvoie un nombre entier pseudo-aléatoire. Les appels répétés renvoient a une série de nombres entiers pseudo-aléatoires.

source: lispref/numbers.texi:1199 If @var{limit} is a positive integer, the value is chosen to be nonnegative and less than @var{limit}.
fr_fr: Si @var{limit} est un nombre entier positif, la valeur est choisie pour être non négative et inférieure à @var{limit}.

source: lispref/numbers.texi:120 The negative integer, @minus{}5, is creating by subtracting 4 from @minus{}1. In binary, the decimal integer 4 is 100. Consequently, @minus{}5 looks like this:
fr_fr: Le nombre entier négatif, @minus{}5, est créé en soustrayant 4 de @minus{}1. Dans la base binaire, le nombre entier décimal 4 est 100. En conséquence, @minus{}5 ressemble à ceci:

source: lispref/numbers.texi:1203 If @var{limit} is @code{t}, it means to choose a new seed based on the current time of day and on Emacs's process @acronym{ID} number.
fr_fr: Si @var{limit} est @code{t}, cela signifie de choisir une nouvelle graine basée sur heure courante et sur le numéro de processus @acronym{ID} d'Emacs.

source: lispref/numbers.texi:1207 On some machines, any integer representable in Lisp may be the result of @code{random}. On other machines, the result can never be larger than a certain maximum or less than a certain (negative) minimum.
fr_fr: Sur quelques machines, n'importe quel nombre entier représentable en Lisp peut être le résultat de @code{random}. Sur d'autres machines, le résultat peut ne jamais être plus grand qu'un certain maximum ou moins qu'un certain minimum (négatif).

source: lispref/numbers.texi:127 In this implementation, the largest 29-bit binary integer value is 268,435,455 in decimal. In binary, it looks like this:
fr_fr: Dans cette exemple, la plus grande valeur de nombre entier binaire de 29 bits est 268 435 455 en décimale. En binaire, elle ressemble à ceci:

source: lispref/numbers.texi:135 Since the arithmetic functions do not check whether integers go outside their range, when you add 1 to 268,435,455, the value is the negative integer @minus{}268,435,456:
fr_fr: Puisque les fonctions arithmétiques ne vérifient pas si les nombres entiers ne sont pas à l'extérieur de leur champ, quand vous additionnez 1 à 268 435 455, la valeur est le nombre entier négatif @minus{}268 435 456:

source: lispref/numbers.texi:140 (+ 1 268435455) @result{} -268435456 @result{} 1 0000 0000 0000 0000 0000 0000 0000
fr_fr: (+ 1 268435455) @result{} -268435456 @result{} 1 0000 0000 0000 0000 0000 0000 0000

source: lispref/numbers.texi:147 Many of the functions described in this chapter accept markers for arguments in place of numbers. (@xref{Markers}.) Since the actual arguments to such functions may be either numbers or markers, we often give these arguments the name @var{number-or-marker}. When the argument value is a marker, its position value is used and its buffer is ignored.
fr_fr: Plusieurs des fonctions décrites dans ce chapitre acceptent des marqueurs commes arguments au lieu des nombres. (@xref{Markers}.) Puisque les arguments réels à de telles fonctions peuvent être des nombres ou des marqueurs, nous donnons souvent à ces arguments le nom de @var{number-or-marker}. Quand la valeur d'argument est un marqueur, sa valeur de position est employée et son tampon est ignoré.

source: lispref/numbers.texi:151 The value of this variable is the largest integer that Emacs Lisp can handle.
fr_fr: La valeur de cette variable est le plus grand nombre entier que Emacs Lisp peut manipuler.

source: lispref/numbers.texi:156 The value of this variable is the smallest integer that Emacs Lisp can handle. It is negative.
fr_fr: La valeur de cette variable est le plus petit nombre entier que Emacs Lisp peut manipuler. Elle est négative.

source: lispref/numbers.texi:165 Floating point numbers are useful for representing numbers that are not integral. The precise range of floating point numbers is machine-specific; it is the same as the range of the C data type @code{double} on the machine you are using.
fr_fr: Les nombres à virgule flottante sont utiles pour la représentation des nombres qui ne sont pas intégraux. Le champ précis des nombres à virgule flottante est propre à la machine; c'est pareil que le champ du type de données de C @code{double} sur la machine que vous employée.

source: lispref/numbers.texi:172 The read-syntax for floating point numbers requires either a decimal point (with at least one digit following), an exponent, or both. For example, @samp{1500.0}, @samp{15e2}, @samp{15.0e2}, @samp{1.5e3}, and @samp{.15e4} are five ways of writing a floating point number whose value is 1500. They are all equivalent. You can also use a minus sign to write negative floating point numbers, as in @samp{-1.0}.
fr_fr: La syntaxe de lecture pour des nombres à virgule flottante exige une virgule décimale (avec au moins un chiffre suivant), un exposant, ou les deux. Par exemple, @samp{1500.0}, @samp{15e2}, @samp{15.0e2}, @samp{1.5e3}, et @samp{.15e4} sont cinq manières d'écrire le nombre à virgule flottante dont la valeur est 1500. Ils sont tous équivalents. Vous pouvez également employer un signe moins pour écrire des nombres négatifs à virgule flottante, comme dans @samp{- 1.0}.

source: lispref/numbers.texi:189 Most modern computers support the @acronym{IEEE} floating point standard, which provides for positive infinity and negative infinity as floating point values. It also provides for a class of values called NaN or ``not-a-number''; numerical functions return such values in cases where there is no correct answer. For example, @code{(/ 0.0 0.0)} returns a NaN. For practical purposes, there's no significant difference between different NaN values in Emacs Lisp, and there's no rule for precisely which NaN value should be used in a particular case, so Emacs Lisp doesn't try to distinguish them (but it does report the sign, if you print it). Here are the read syntaxes for these special floating point values:
fr_fr: La plupart des ordinateurs modernes soutiennent la norme à virgule flottante @acronym{IEEE}, qui prévoit plus l'infini et moins l'infini comme valeurs à virgule flottante. Elle prévoit également une classe de valeurs appelées NaN ou ``not-a-number''; les fonctions numériques renvoient de telles valeurs dans les cas où il n'y a aucune réponse correcte. Par exemple, @code{(/ 0.0 0.0)} renvoie NaN. Pour des buts pratiques, il n'y a aucune différence significative entre différentes valeurs de NaN en Emacs Lisp, et il n'y a aucune règle pour la valeur NaN à utiliser dans un cas particulier, ainsi Emacs Lisp n'essaye pas de les distinguer (mais rapporte le signal, si vous l'affichez). Voici les syntaxes lues pour ces valeurs à virgule flottante spéciales:

source: lispref/numbers.texi:20 GNU Emacs supports two numeric data types: @dfn{integers} and @dfn{floating point numbers}. Integers are whole numbers such as @minus{}3, 0, 7, 13, and 511. Their values are exact. Floating point numbers are numbers with fractional parts, such as @minus{}4.5, 0.0, or 2.71828. They can also be expressed in exponential notation: 1.5e2 equals 150; in this example, @samp{e2} stands for ten to the second power, and that is multiplied by 1.5. Floating point values are not exact; they have a fixed, limited amount of precision.
fr_fr: GNU Emacs supporte deux types de données numériques: @dfn{entiers} et @dfn{nombres à virgule flottante}. Les nombres entiers sont des nombres entiers tels que @minus{}3, 0, 7, 13, et 511. Leurs valeurs sont exactes. Les nombres à virgule flottante sont des nombres avec les parties partielles, telles que le @minus{}4.5, 0.0, ou 2.71828. Ils peuvent également être exprimés en notation exponentielle: 1.5e2 est égal à 150; dans cet exemple, le @samp{e2} représente dix à la puissance deux, le tout est multiplié par 1.5. Les valeurs à virgule flottante ne sont pas exactes; elles sont fixe et limitée en précision.

source: lispref/numbers.texi:202 To test whether a floating point value is a NaN, compare it with itself using @code{=}. That returns @code{nil} for a NaN, and @code{t} for any other floating point value.
fr_fr: Pour examiner si une valeur à virgule flottante est NaN, le comparer à lui-même en employant @code{=}. Il renvoie @code{nil} pour NaN, et @code{t} pour n'importe quelle autre valeur à virgule flottante.

source: lispref/numbers.texi:206 The value @code{-0.0} is distinguishable from ordinary zero in @acronym{IEEE} floating point, but Emacs Lisp @code{equal} and @code{=} consider them equal values.
fr_fr: La valeur @code{-0.0} est distinguable de l'ordinaire zéro dans la virgule flottante de @acronym{IEEE}, mais l'Emacs Lisp @code{equal} et @code{=} les considèrent comme valeurs égales.

source: lispref/numbers.texi:209 You can use @code{logb} to extract the binary exponent of a floating point number (or estimate the logarithm of an integer):
fr_fr: Vous pouvez employer @code{logb} pour extraire l'exposant binaire d'un nombre à virgule flottante (ou estimer le logarithme d'un nombre entier):

source: lispref/numbers.texi:214 This function returns the binary exponent of @var{number}. More precisely, the value is the logarithm of @var{number} base 2, rounded down to an integer.
fr_fr: Cette fonction renvoie l'exposant binaire de @var{number}. Plus précisément, la valeur est le logarithme de @var{number} en base 2, arrondie vers le bas à un nombre entier.

source: lispref/numbers.texi:233 The functions in this section test for numbers, or for a specific type of number. The functions @code{integerp} and @code{floatp} can take any type of Lisp object as argument (they would not be of much use otherwise), but the @code{zerop} predicate requires a number as its argument. See also @code{integer-or-marker-p} and @code{number-or-marker-p}, in @ref{Predicates on Markers}.
fr_fr: Les fonctions dans cette section testent les nombres, ou un type spécifique de nombre. Les fonctions @code{integerp} et @code{floatp} peuvent prendre n'importe quel type d'objet de Lisp comme argument (ils ne seraient pas utiles autrement), mais l'attribut @code{zerop} exige un nombre en tant qu'argument. Voir également @code{integer-or-marker-p} et @code{number-ou-marker-p}, dans le @ref{Predicates on Markers}.

source: lispref/numbers.texi:237 This predicate tests whether its argument is a floating point number and returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cet attribut examine si son argument est un nombre à virgule flottante et renvoie @code{t} si oui, @code{nil} autrement.

source: lispref/numbers.texi:244 This predicate tests whether its argument is an integer, and returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cet attribut examine si son argument est un nombre entier, et renvoie le @code{t} si oui, @code{nil} autrement.

source: lispref/numbers.texi:249 This predicate tests whether its argument is a number (either integer or floating point), and returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cet attribut examine si son argument est un nombre (nombre entier ou virgule flottante), et renvoie le @code{t} si oui, @code{nil} autrement.

source: lispref/numbers.texi:257 The @code{wholenump} predicate (whose name comes from the phrase ``whole-number-p'') tests to see whether its argument is a nonnegative integer, and returns @code{t} if so, @code{nil} otherwise. 0 is considered non-negative.
fr_fr: L'attribut @code{wholenump} (dont le nom vient de l'expression ``whole-number-p'') teste pour voir si son argument est un nombre entier non négatif, et renvoie le @code{t} si oui, @code{nil} autrement. 0 est considéré non négatif.

source: lispref/numbers.texi:265 This predicate tests whether its argument is zero, and returns @code{t} if so, @code{nil} otherwise. The argument must be a number.
fr_fr: Cet attribut examine si son argument est zéro, et renvoie @code{t} si oui, @code{nil} autrement. L'argument doit être un nombre.

source: lispref/numbers.texi:280 To test numbers for numerical equality, you should normally use @code{=}, not @code{eq}. There can be many distinct floating point number objects with the same numeric value. If you use @code{eq} to compare them, then you test whether two values are the same @emph{object}. By contrast, @code{=} compares only the numeric values of the objects.
fr_fr: Pour tester l'égalité numérique des nombres, vous devriez normalement employer @code{=}, pas @code{eq}. Il peut y avoir beaucoup d'objets distincts de nombre à virgule flottante avec la même valeur numérique. Si vous employez @code{eq} pour les comparer, vous testez si deux valeurs sont des @emph{objets} identiques. En revanche, @code{=} compare seulement les valeurs numériques des objets.

source: lispref/numbers.texi:290 At present, each integer value has a unique Lisp object in Emacs Lisp. Therefore, @code{eq} is equivalent to @code{=} where integers are concerned. It is sometimes convenient to use @code{eq} for comparing an unknown value with an integer, because @code{eq} does not report an error if the unknown value is not a number---it accepts arguments of any type. By contrast, @code{=} signals an error if the arguments are not numbers or markers. However, it is a good idea to use @code{=} if you can, even for comparing integers, just in case we change the representation of integers in a future Emacs version.
fr_fr: Actuellement, chaque valeur de nombre entier a un objet unique de Lisp dans Emacs Lisp. Par conséquent, @code{eq} est équivalent au @code{=} quand des nombres entiers sont concernés. Il est parfois commode d'employer @code{eq} pour comparer une valeur inconnue à un nombre entier, parce que @code{eq} ne rapporte pas d'erreur si la valeur inconnue n'est pas un nombre---il accepte des arguments de n'importe quel type---. En revanche, @code{=} signale une erreur si les arguments ne sont pas des nombres ou des marqueurs. Cependant, c'est une bonne idée d'employer @code{=} si vous le pouvez, même pour comparer des nombres entiers, juste au cas où nous changerions la représentation des nombres entiers dans une future version d'Emacs.

source: lispref/numbers.texi:296 Sometimes it is useful to compare numbers with @code{equal}; it treats two numbers as equal if they have the same data type (both integers, or both floating point) and the same value. By contrast, @code{=} can treat an integer and a floating point number as equal. @xref{Equality Predicates}.
fr_fr: Parfois il est utile de comparer des nombres avec @code{equal}; les deux nombres sont traités comme égaux s'ils ont le même type de données (les deux sont des nombres entiers, ou à virgule flottante) et la même valeur. En revanche, @code{=} peut traiter un nombre entier et un nombre à virgule flottante en tant qu'égaux. @xref{Equality Predicates}.

source: lispref/numbers.texi:301 There is another wrinkle: because floating point arithmetic is not exact, it is often a bad idea to check for equality of two floating point values. Usually it is better to test for approximate equality. Here's a function to do this:
fr_fr: Il y a un autre problème: parce que l'arithmétique de virgule flottante n'est pas exacte, c'est souvent une mauvaise idée de vérifier l'égalité de deux valeurs à virgule flottante. Habituellement il vaut mieux déterminer l'égalité approximative. Voici une fonction pour faire ceci:

source: lispref/numbers.texi:309 (defvar fuzz-factor 1.0e-6) (defun approx-equal (x y) (or (and (= x 0) (= y 0)) (< (/ (abs (- x y)) (max (abs x) (abs y))) fuzz-factor)))
fr_fr: (defvar fuzz-factor 1.0e-6) (defun approx-equal (x y) (or (and (= x 0) (= y 0)) (< (/ (abs (- x y)) (max (abs x) (abs y))) fuzz-factor)))

source: lispref/numbers.texi:318 @b{Common Lisp note:} Comparing numbers in Common Lisp always requires @code{=} because Common Lisp implements multi-word integers, and two distinct integer objects can have the same numeric value. Emacs Lisp can have just one integer object for any given value because it has a limited range of integer values.
fr_fr: @b{Common Lisp note:} Comparer des nombres en Common Lisp exige toujours @code{=} parce que le Common Lisp met en application des nombres entiers pluritermes, et deux objets distincts de nombre entier peuvent avoir la même valeur numérique. L'Emacs Lisp peut avoir juste un objet de nombre entier pour n'importe quelle valeur donnée parce qu'il a un champ limité des valeurs de nombre entier.

source: lispref/numbers.texi:323 This function tests whether its arguments are numerically equal, and returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si ses arguments sont numériquement égaux, et renvoie le @code{t} si oui, @code{nil} autrement.

source: lispref/numbers.texi:330 This function acts like @code{eq} except when both arguments are numbers. It compares numbers by type and numeric value, so that @code{(eql 1.0 1)} returns @code{nil}, but @code{(eql 1.0 1.0)} and @code{(eql 1 1)} both return @code{t}.
fr_fr: Cette fonction agit comme @code{eq} sauf quand les deux arguments sont des nombres. Elle compare des nombres par le type et la valeur numérique, de sorte que @code{(eql 1.0 1)} renvoie le @code{nil}, mais @code{(eql 1.0 1.0)} et @code{(eql 1 1)} renvoient tous les deux le @code{t}.

source: lispref/numbers.texi:335 This function tests whether its arguments are numerically equal, and returns @code{t} if they are not, and @code{nil} if they are.
fr_fr: Cette fonction teste si ses arguments sont numériquement égaux, et renvoie @code{t} s'ils ne sont pas égaux, et @code{nil} s'ils sont égaux.

source: lispref/numbers.texi:340 This function tests whether its first argument is strictly less than its second argument. It returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si son premier argument est strictement moins grand que son deuxième argument. Elle renvoie @code{t} si oui, @code{nil} autrement.

source: lispref/numbers.texi:346 This function tests whether its first argument is less than or equal to its second argument. It returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si son premier argument est inférieur ou égal à son deuxième argument. Elle renvoie @code{t} si oui, @code{nil} autrement.

source: lispref/numbers.texi:352 This function tests whether its first argument is strictly greater than its second argument. It returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si son premier argument est strictement plus grand que son deuxième argument. Elle renvoie @code{t} si oui, @code{nil} autrement.

source: lispref/numbers.texi:358 This function tests whether its first argument is greater than or equal to its second argument. It returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cette fonction teste si son premier argument est supérieur ou égal à son deuxième argument. Il renvoie @code{t} si oui, @code{nil} autrement.

source: lispref/numbers.texi:364 This function returns the largest of its arguments. If any of the arguments is floating-point, the value is returned as floating point, even if it was given as an integer.
fr_fr: Cette fonction renvoie le plus grand de ses arguments. Si l'un des arguments est à virgule flottante, la valeur est retournée à virgule flottante, même si elle était donnée comme nombre entier.

source: lispref/numbers.texi:379 This function returns the smallest of its arguments. If any of the arguments is floating-point, the value is returned as floating point, even if it was given as an integer.
fr_fr: Cette fonction renvoie le plus petit de ses arguments. Si l'un des arguments est à virgule flottante, la valeur est retournée à virgule flottante, même si elle était donnée comme nombre entier.

source: lispref/numbers.texi:383 (min -4 1) @result{} -4
fr_fr: (min -4 1) @result{} -4

source: lispref/numbers.texi:40 The range of values for an integer depends on the machine. The minimum range is @minus{}268435456 to 268435455 (29 bits; i.e.,
fr_fr: Le champ des valeurs pour un nombre entier dépend de la machine. Le champ minimum est @minus{}268435456 à 268435455 (29 bits; c.-à-d.,

source: lispref/numbers.texi:402 This returns @var{number} converted to floating point. If @var{number} is already a floating point number, @code{float} returns it unchanged.
fr_fr: Ceci renvoie @var{number} converti en un nombre à virgule flottante. Si @var{number} est déjà un nombre à virgule flottante, @code{float} le renvoie sans changement.
